results/raw/proxysql_mux_ff_prepared_tlsTrue_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1326917
number of failed transactions: 0 (0.000%)
latency average = 8.665 ms
latency stddev = 9.049 ms
initial connection time = 283.015 ms
tps = 7381.707429 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 7052.7 tps, lat 8.780 ms stddev 9.372, 0 failed
progress: 20.0 s, 7432.4 tps, lat 8.607 ms stddev 8.807, 0 failed
progress: 30.0 s, 7411.4 tps, lat 8.633 ms stddev 8.955, 0 failed
progress: 40.0 s, 7387.6 tps, lat 8.660 ms stddev 9.065, 0 failed
progress: 50.0 s, 7368.9 tps, lat 8.686 ms stddev 8.901, 0 failed
progress: 60.0 s, 7444.0 tps, lat 8.597 ms stddev 8.744, 0 failed
progress: 70.0 s, 7324.2 tps, lat 8.735 ms stddev 9.122, 0 failed
progress: 80.0 s, 7390.6 tps, lat 8.658 ms stddev 9.035, 0 failed
progress: 90.0 s, 7406.4 tps, lat 8.638 ms stddev 8.984, 0 failed
progress: 100.0 s, 7385.9 tps, lat 8.664 ms stddev 8.800, 0 failed
progress: 110.0 s, 7389.5 tps, lat 8.656 ms stddev 9.162, 0 failed
progress: 120.0 s, 7247.3 tps, lat 8.829 ms stddev 9.368, 0 failed
progress: 130.0 s, 7332.1 tps, lat 8.727 ms stddev 9.200, 0 failed
progress: 140.0 s, 7477.9 tps, lat 8.557 ms stddev 8.819, 0 failed
progress: 150.0 s, 7429.6 tps, lat 8.604 ms stddev 9.184, 0 failed
progress: 160.0 s, 7408.4 tps, lat 8.643 ms stddev 9.265, 0 failed
progress: 170.0 s, 7435.5 tps, lat 8.605 ms stddev 8.952, 0 failed
progress: 180.0 s, 7361.2 tps, lat 8.684 ms stddev 9.089, 0 failed