results/raw/proxysql_mux_ffto_extended_tlsFalse_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1396142
number of failed transactions: 0 (0.000%)
latency average = 8.238 ms
latency stddev = 8.656 ms
initial connection time = 257.843 ms
tps = 7765.653262 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 7540.2 tps, lat 8.263 ms stddev 8.732, 0 failed
progress: 20.0 s, 7775.1 tps, lat 8.229 ms stddev 8.921, 0 failed
progress: 30.0 s, 7816.1 tps, lat 8.186 ms stddev 8.477, 0 failed
progress: 40.0 s, 7826.0 tps, lat 8.174 ms stddev 8.607, 0 failed
progress: 50.0 s, 7791.0 tps, lat 8.215 ms stddev 8.745, 0 failed
progress: 60.0 s, 7527.5 tps, lat 8.502 ms stddev 8.988, 0 failed
progress: 70.0 s, 7817.1 tps, lat 8.184 ms stddev 8.657, 0 failed
progress: 80.0 s, 7803.1 tps, lat 8.200 ms stddev 8.699, 0 failed
progress: 90.0 s, 7855.3 tps, lat 8.141 ms stddev 8.603, 0 failed
progress: 100.0 s, 7819.2 tps, lat 8.188 ms stddev 8.429, 0 failed
progress: 110.0 s, 7839.1 tps, lat 8.158 ms stddev 8.407, 0 failed
progress: 120.0 s, 7768.6 tps, lat 8.237 ms stddev 8.759, 0 failed
progress: 130.0 s, 7755.1 tps, lat 8.254 ms stddev 8.924, 0 failed
progress: 140.0 s, 7750.3 tps, lat 8.248 ms stddev 8.620, 0 failed
progress: 150.0 s, 7826.0 tps, lat 8.182 ms stddev 8.374, 0 failed
progress: 160.0 s, 7803.7 tps, lat 8.202 ms stddev 8.596, 0 failed
progress: 170.0 s, 7508.8 tps, lat 8.513 ms stddev 8.750, 0 failed
progress: 180.0 s, 7786.2 tps, lat 8.222 ms stddev 8.485, 0 failed