results/raw/proxysql_mux_ffto_prepared_tlsTrue_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 128994
number of failed transactions: 0 (0.000%)
latency average = 1.395 ms
latency stddev = 0.321 ms
initial connection time = 16.092 ms
tps = 716.692711 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 669.5 tps, lat 1.491 ms stddev 0.424, 0 failed
progress: 20.0 s, 680.2 tps, lat 1.470 ms stddev 0.094, 0 failed
progress: 30.0 s, 682.0 tps, lat 1.466 ms stddev 0.083, 0 failed
progress: 40.0 s, 680.2 tps, lat 1.470 ms stddev 0.093, 0 failed
progress: 50.0 s, 746.3 tps, lat 1.339 ms stddev 0.131, 0 failed
progress: 60.0 s, 746.7 tps, lat 1.339 ms stddev 0.145, 0 failed
progress: 70.0 s, 803.7 tps, lat 1.244 ms stddev 0.081, 0 failed
progress: 80.0 s, 836.2 tps, lat 1.196 ms stddev 0.068, 0 failed
progress: 90.0 s, 843.7 tps, lat 1.185 ms stddev 0.061, 0 failed
progress: 100.0 s, 845.2 tps, lat 1.183 ms stddev 0.056, 0 failed
progress: 110.0 s, 624.1 tps, lat 1.602 ms stddev 0.472, 0 failed
progress: 120.0 s, 550.5 tps, lat 1.816 ms stddev 0.164, 0 failed
progress: 130.0 s, 483.1 tps, lat 2.070 ms stddev 0.352, 0 failed
progress: 140.0 s, 494.2 tps, lat 2.023 ms stddev 0.289, 0 failed
progress: 150.0 s, 691.1 tps, lat 1.447 ms stddev 0.359, 0 failed
progress: 160.0 s, 830.3 tps, lat 1.204 ms stddev 0.055, 0 failed
progress: 170.0 s, 840.1 tps, lat 1.190 ms stddev 0.075, 0 failed
progress: 180.0 s, 852.2 tps, lat 1.173 ms stddev 0.065, 0 failed