results/raw/proxysql_mux_ffto_simple_tlsFalse_c128.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 128
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1365706
number of failed transactions: 0 (0.000%)
latency average = 16.828 ms
latency stddev = 22.309 ms
initial connection time = 464.000 ms
tps = 7603.646525 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 7182.5 tps, lat 16.962 ms stddev 21.914, 0 failed
progress: 20.0 s, 7608.9 tps, lat 16.798 ms stddev 22.767, 0 failed
progress: 30.0 s, 7672.3 tps, lat 16.699 ms stddev 21.546, 0 failed
progress: 40.0 s, 7644.5 tps, lat 16.748 ms stddev 21.466, 0 failed
progress: 50.0 s, 7569.8 tps, lat 16.891 ms stddev 23.336, 0 failed
progress: 60.0 s, 7592.5 tps, lat 16.865 ms stddev 21.903, 0 failed
progress: 70.0 s, 7543.2 tps, lat 16.959 ms stddev 23.796, 0 failed
progress: 80.0 s, 7630.0 tps, lat 16.768 ms stddev 22.884, 0 failed
progress: 90.0 s, 7634.8 tps, lat 16.776 ms stddev 22.099, 0 failed
progress: 100.0 s, 7433.0 tps, lat 17.194 ms stddev 23.174, 0 failed
progress: 110.0 s, 7562.5 tps, lat 16.945 ms stddev 22.424, 0 failed
progress: 120.0 s, 7643.4 tps, lat 16.760 ms stddev 22.179, 0 failed
progress: 130.0 s, 7614.0 tps, lat 16.791 ms stddev 21.996, 0 failed
progress: 140.0 s, 7663.5 tps, lat 16.674 ms stddev 21.656, 0 failed
progress: 150.0 s, 7651.4 tps, lat 16.765 ms stddev 22.165, 0 failed
progress: 160.0 s, 7612.5 tps, lat 16.794 ms stddev 21.955, 0 failed
progress: 170.0 s, 7639.8 tps, lat 16.769 ms stddev 21.508, 0 failed
progress: 180.0 s, 7660.3 tps, lat 16.718 ms stddev 22.595, 0 failed